### `Data Merge`
Data merge is a process of combining information from different datasets into a single dataset. It involves bringing together data from multiple sources or tables based on a common identifier or key. This allows you to create a unified view of your data, making it easier to analyze and draw insights from. In simple terms, data merge helps you consolidate and organize data from various sources into one comprehensive dataset.

In [7]:
import pandas as pd
data1={
    'id':[1,2,3],
    'name':["ali","ahmed","zakir"],
    'age':[10,20,30]
}
df1 = pd.DataFrame(data1)
df1.head()

   id   name  age
0   1    ali   10
1   2  ahmed   20
2   3  zakir   30

In [8]:
data2 = {
    'id': [1, 2, 4],
    'salery': [1000, 2000, 3000],
    'occupation': ["engineer", "doctor", "police"]
}
df2=pd.DataFrame(data2)
df2.head()

   id  salery occupation
0   1    1000   engineer
1   2    2000     doctor
2   4    3000     police

In [9]:
pd.merge(df1,df2, on='id', how='inner')

   id   name  age  salery occupation
0   1    ali   10    1000   engineer
1   2  ahmed   20    2000     doctor

---
Data Concatination

In [13]:
import pandas as pd
data1={'Name':["ali","ahmed","zakir"],'age':[10,20,30]}
data2={'Name':["zamin","kazim","shakir"],'age':[11,22,32]}
data3={'city':["karachi","islamabad","skardu"],'provence':['sindh','punjab','GB']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [14]:
# Concativate rows
pd.concat([df1,df2])

     Name  age
0     ali   10
1   ahmed   20
2   zakir   30
0   zamin   11
1   kazim   22
2  shakir   32

In [15]:
# concativate two data set on the basis of column
pd.concat([df1,df3],axis=1) # if we write axis=1 its means concativate on the basis of column

    Name  age       city provence
0    ali   10    karachi    sindh
1  ahmed   20  islamabad   punjab
2  zakir   30     skardu       GB

### **`Concatenate`**
"Concatenate" refers to the process of joining two or more datasets together along a specified axis, such as rows or columns. It essentially involves stacking or appending datasets together to form a larger dataset.

`**Difference between merge and concatenate:**`

Merge: Combines datasets by matching rows based on common values in specified columns. It is typically used to combine datasets with related information.
Concatenate: Joins datasets along a specified axis (either rows or columns) without considering any common values. It is often used to stack datasets vertically or horizontally, regardless of their content.

###   `Remove Duplicate Value from a data set on the basis of subset`

In [23]:
import pandas as pd
data1={'Name':["ali","ahmed","zakir",'ali'],'age':[10,20,30,20]}
df1 = pd.DataFrame(data1)
df1

    Name  age
0    ali   10
1  ahmed   20
2  zakir   30
3    ali   20

In [24]:
drop=df1.drop_duplicates()
drop

    Name  age
0    ali   10
1  ahmed   20
2  zakir   30
3    ali   20

From above code duplicate are not removed because in age column the age are different with each other that's why that are not drop, they consider as unique value

In [25]:
drop1=df1.drop_duplicates(subset='Name') # if we want to drop on the basis of name
drop1

    Name  age
0    ali   10
1  ahmed   20
2  zakir   30